<ul>
<li>»справление ошибки с получением размеров изображений, котора€ могла возникать на некоторых сайтах.</li>
<li>¬ настройках модул€ добавлен предпросмотр выбранной картинки в качестве вод€ного знака.</li>
<li>¬ настройках модул€ выбор полей и свойств инфоблоков стал удобнее: теперь селектор полей и свойств по€вл€етс€ сразу после выбора соответствующего инфоблока, а не после применени€ настроек как раньше.</li>
<li>»спользование функционала €дра D7 дл€ работы модул€.</li>
<li>Ќезначительные правки.</li>
</ul>